###**1： 字符集基本概念**

#####字符集   ：是一个系统支持所有抽象符的集合，其内部维护的就是一个映射关系。
#####字符编码 ：是指自然语言与一套数字建立系统之间，建立的一套关系。如 utf-8 , utf-16等编码

###**2: 常用的字符集(额外的知识补充：一个字节=8位)**
#####ASCII字符集 : 由固定的一个字符进行编码。前期采用了7位作为一个字符，当时只能有127个字符，后来欧洲人民把他扩展成8位表示一个字符，因此现在也只能显示256个文字。

#####GBXXXX字符集 : 包含了 gb2312/gb2312-80 gb18030-2005 两种编码方式。
#####gb2312/gb2312-80 : 根据ASCII，保持了 127 之前的字符，在127后，扩展了ASCII的高字节（前4为）从 0xA1 到 0xF7 ，低字节（后4位）从 0xA1 到 0xFE。
#####gb18030-2005     : 与 utf8 类似，以变长字符的方式，具体可以为 1,2,4 字节。可保存 161 万个字符。   

#####BIG5字符集 : 在2005年，big5-2005这种编码方式，被收录进CNS11643，总算取得了正式的地位。用于繁体字地区，如 香港，台湾。采用的固定两个字符长度进行编码

#####Unicode字符集 : 被称为万国码，编码方式较多。常见的有
#####utf8     : 变长字符串，采用 1-4 个字节进行字符编码。其编码规则为如下
##### 1> 128个US-ASCII字符只需一个字节编码（Unicode范围由U+0000至U+007F）。
#####2> 带有附加符号的拉丁文、希腊文、西里尔字母、亚美尼亚语、希伯来文、阿拉伯文、叙利亚文及它拿字母则需要二个字节编码（Unicode范围由U+0080至U+07FF）。
#####3> 其他基本多文种平面（BMP）中的字符（这包含了大部分常用字）使用三个字节编码。
#####4> 其他极少使用的Unicode辅助平面的字符使用四字节编码。 
#####utf16-le : BOM为 FF FE 进行表示，变长字符,最小用两个字符进行编码。小端
#####utf16-be : BOM为 FE FF 进行标识，变长字符,最小用两个字符进行编码。大端
#####ucs 32-le   : BOM为 FF FE，用 4 个字节表示一个汉字，其储存空间大，但是可以通过常数方式进行寻找，其中linux下的 std::wstring 就是利用该编码方式
#####ucs 32-be   : BOM为 FE FF，用 4 个字节表示一个汉字，其储存空间大，但是可以通过常数方式进行寻找，其中linux下的 std::wstring 就是利用该编码方式
